<font size=+2 color="indigo"><center><b>Семинар 8 - 9</b></center></font>

<font size=+2 color="indigo"><center><b> Знакомство с библиотекой Pandas </b></center></font>

<a id="top"></a>

<div class="list-group" id="list-tab" role="tablist">
<big class="list-group-item list-group-item-action active" data-toggle="list"  role="tab" aria-controls="home"> СТРУКТУРА СЕМИНАРА</big>

* [1. Некорректное название переменных](#1)


* [2. Pandas](#2)


*   * [2.1 Series](#2.1)


*   * [2.2 DataFrame](#2.2)


*   * [2.3 Загрузка данных](#2.3)


* [3. Pandas](#3)

<a id="1"></a>
    
<font size="+2" color="indigo"><b>1. Некорректное название переменных</b></font><br>

In [ ]:
# Давайте рассмотрим функцию sum().
# Данная функция складывает элементы массива.

In [94]:
# Пример:

sum([1,2,3,4])

10

In [95]:
# Создадим переменную с названием sum.

sum = 10

In [96]:
# Снова посчитаем сумму массива.

sum([1,2,3,4])

# Как мы видим, произошла ошибка. 
# Это произошло из-за того, что мы переопределили название.

# Старайтесь называть переменные именем, отличным от имени функций,
# заложенных в Python, чтобы система работала корректно.

TypeError: 'int' object is not callable

In [98]:
# Ещё пример 

len([1,2,3,4])

4

In [99]:
len = 5

In [100]:
len([1,2,3,4])

TypeError: 'int' object is not callable

<a id="2"></a>
    
<font size="+2" color="indigo"><b>2. Pandas</b></font><br>

**Pandas - это библиотека, которая предоставляет очень удобные, с точки
зрения использования, инструменты для хранения и работы с данными.
Если вы занимаетесь анализом данных или машинным обучением и при
этом используете язык Python, то знание pandas значительно упростит
вам работу.**

Библиотека pandas предоставляет две структуры: Series и DataFrame
для быстрой и удобной работы с данными (на самом деле их три, есть
еще одна структура - Panel, но в данный момент она имеет статус
deprecated и в будущем будет исключена из состава библиотеки pandas).


**Series** - это маркированная одномерная структура данных, ее можно
представить, как таблицу с одной строкой (или столбцом). С Series
можно работать как с обычным массивом (обращаться по номеру
индекса), и как с ассоциированным массивом, в этом случае можно
использовать ключ для доступа к элементам данных.


**DataFrame** - это двумерная маркированная структура. Идейно она очень
похожа на обычную таблицу, что выражается в способе ее создания и
работе с ее элементами.


**Panel** - представляет собой трехмерную структуру данных. О Panel мы
больше говорить не будем. В рамках этой части мы остановимся на
вопросах создания и получения доступа к элементам данных структур
Series и DataFrame.

[Devpractice Team. Pandas. Работа с данными. 2-е изд. - devpractice.ru. 2020. - 170 с.:
ил.](https://drive.google.com/drive/folders/1R1mu1Dk_hWbt1fa9dZrbqYOBT-498RM4)

In [ ]:
# Если вы ни разу до этого не работали с библиотекой Pandas,
# вам необходимо установить её на компьютер. Это можно сделать
# с помощью строчки, написанной ниже.

# pip install pandas

In [2]:
# После установки, чтобы работать с библиотекой, вам необходимо
# её импортировать в среду разработки.

import pandas as pd  # pd - это стандартное сокращение.

<a id="2.1"></a>
    
<font size="+2" color="indigo"><b>2.1 Series</b></font><br>

**Series** - это маркированная одномерная структура данных, ее можно
представить, как таблицу с одной строкой (или столбцом). С Series
можно работать как с обычным массивом (обращаться по номеру
индекса), и как с ассоциированным массивом, в этом случае можно
использовать ключ для доступа к элементам данных.

Series можно создать с помощью списка, массива и словаря.

**Создание с помощью списка**

In [3]:
# Чтобы создать объект Series, сначала вводим следующую функцию: pd.Series()
# Внутрь функции передаём массив, или словарь, или список.

pd.Series([1,2,3,4,5]) # Создаём с помощью списка.

# Колонка слева - это индексы, а справа - наши элементы - так же, как и в списках.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [102]:
type(pd.Series([1,2,3,4,5])) # У объекта Series свой собственный тип.

pandas.core.series.Series

In [103]:
# Индексы необязательно могут быть численными.

pd.Series(data = [6,7,3,9,5], index = ["a","b","c","d","e"])

a    6
b    7
c    3
d    9
e    5
dtype: int64

In [104]:
# Индексы даже могут содержать числовые и строковые значения.

pd.Series(data = [6,7,3,9,5], index = [0,"b",1,"d","e"])

0    6
b    7
1    3
d    9
e    5
dtype: int64

**Создание с помощью массива**

In [8]:
# Чтобы создать массив, изначально необходимо импортировать 
# библиотеку numpy.
import numpy as np # np - это стандартное сокращение.

In [106]:
np.array([1,4,5,3,5]) # Таким образом создаётся массив.

array([1, 4, 5, 3, 5])

In [107]:
type(np.array([1,4,5,3,5])) # У массива свой тип.

numpy.ndarray

In [108]:
# Массивы похожи на списки, но только визуально. Ниже показано различие
# между ними.

np.array([1,4,5,3,5])+np.array([1,4,5,3,5]), [1,4,5,3,5]+[1,4,5,3,5]

# Массивы - это, по своей сути, вектора, с ними можно выполнять 
# арифметические операции. В данном случае соответствующие элементы
# массива сложились, а вот список просто увеличидся в длине.

(array([ 2,  8, 10,  6, 10]), [1, 4, 5, 3, 5, 1, 4, 5, 3, 5])

In [9]:
# Создадим собственные индексы.

pd.Series(data = np.array([1,4,5,3,5]), index = np.array([1,4,5,3,5]))

1    1
4    4
5    5
3    3
5    5
dtype: int32

**Создание с помощью словаря**

In [114]:
# Словарь - это структура, которая имеет ключ - значение.
# Создаётся словарь следующим образом:

dict_name = {"Иван":"12/12/1994", "Андрей":"15/06/1998", "Антон":"05/03/2004"}
            #  ключ : значение,      ключ : значение,       ключ : значение

# Словарь создаётся с помощью фигурных скобок. Внутри фигурных скобок 
# через двоеточия записываются значения. Сначала идёт ключ, а потом значение.
# Только по ключу мы сможем вытащить значение из словаря.

In [115]:
dict_name["Иван"], dict_name["Андрей"], dict_name["Антон"]

('12/12/1994', '15/06/1998', '05/03/2004')

In [116]:
dict_name["Алексей"] # Ошибка Ключа (такого ключа не существует).

KeyError: 'Алексей'

In [118]:
my_series = pd.Series(dict_name)
my_series

Иван      12/12/1994
Андрей    15/06/1998
Антон     05/03/2004
dtype: object

In [122]:
my_series.index # Доступ к индексам.

Index(['Иван', 'Андрей', 'Антон'], dtype='object')

In [123]:
# К значениям объекта Series можно достучаться двумя способами:
# через название индекс и через номер строки (как в списках, нумерация начинается с нуля).

my_series[0], my_series['Иван']

('12/12/1994', '12/12/1994')

**Операции с Series**

In [124]:
# Создадим Series.

my_dict = {"a":1, "b":2, "c":3, "d":5, "e":0}
my_series = pd.Series(my_dict)
my_series

a    1
b    2
c    3
d    5
e    0
dtype: int64

In [126]:
my_series[my_series <=2] # Хотим выбрать элементы, которые меньше или равны двум.

a    1
b    2
e    0
dtype: int64

In [127]:
my_series <=2  # Как мы видим выше, выбрались те элементы, на местах которых стояло слово True.

a     True
b     True
c    False
d    False
e     True
dtype: bool

In [128]:
my_series+my_series+my_series # Серии можно складывать.

a     3
b     6
c     9
d    15
e     0
dtype: int64

In [131]:
my_series*3 # Серии можно умножать.

a     3
b     6
c     9
d    15
e     0
dtype: int64

In [130]:
my_series**3 # Серии можно возводить в степень.

a      1
b      8
c     27
d    125
e      0
dtype: int64

In [129]:
my_series - my_series  # Серии можно вычитать.

a    0
b    0
c    0
d    0
e    0
dtype: int64

<a id="2.2"></a>
    
<font size="+2" color="indigo"><b>2.2 DataFrame</b></font><br>

**DataFrame** - это двумерная маркированная структура. Идейно она очень
похожа на обычную таблицу, что выражается в способе ее создания и
работе с ее элементами.

In [ ]:
# DataFrame будем создавать с помощью словаря.
# Чтобы созать объект DataFrame, сначала вводим следующую функцию: pd.DataFrame()

In [151]:
my_data = [{"price":8, "count":10}, {"price":9, "count":120}, {"price":1, "count":13},
        {"price":78, "count":108}, {"price":81, "count":120}, {"price":8, "count":310}]
# Как мы видим выше, элементы словаря должны находиться в списке, чтобы
# при создании серии не вознакало ошибки.

data_frame =  pd.DataFrame(my_data)
data_frame

# Как мы можем заметить, DataFrame - это просто таблица.

   price  count
0      8     10
1      9    120
2      1     13
3     78    108
4     81    120
5      8    310

In [25]:
data_frame.index # Таким образом можно достучаться до индексов.

RangeIndex(start=0, stop=6, step=1)

In [134]:
data_frame.columns # Таким образом можно достучаться до названия колонок.

Index(['price', 'count'], dtype='object')

**Метод info()**

In [ ]:
# Метод info() применяется для того, чтобы узнать информацию о DataFrame.

In [27]:
data_frame

   price  count
0      8     10
1      9    120
2      1     13
3     78    108
4     81    120
5      8    310

In [33]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   price   6 non-null      int64
 1   count   6 non-null      int64
dtypes: int64(2)
memory usage: 224.0 bytes

In [ ]:
# Как мы видим, метод info() показывает название колонок, тип колонок,
# количество ненулевых элементов в колонке, память, которую занимает колонка.

**Доступ к колонке**

In [135]:
data_frame

   price  count
0      8     10
1      9    120
2      1     13
3     78    108
4     81    120
5      8    310

In [34]:
data_frame["price"] # Чтобы получить все элементы колонки, 
                    # необходимо в квадратных скобках записать название колонки.

0     8
1     9
2     1
3    78
4    81
5     8
Name: price, dtype: int64

In [35]:
data_frame["count"]

0     10
1    120
2     13
3    108
4    120
5    310
Name: count, dtype: int64

In [36]:
data_frame["count"] + data_frame["price"] # Также можно производить различные арифметические операции.

0     18
1    129
2     14
3    186
4    201
5    318
dtype: int64

In [37]:
data_frame["count"]*data_frame["price"]

0      80
1    1080
2      13
3    8424
4    9720
5    2480
dtype: int64

**Создание новых колонок**

In [152]:
data_frame

   price  count
0      8     10
1      9    120
2      1     13
3     78    108
4     81    120
5      8    310

In [153]:
# Чтобы создать новую колонку, пишем в квадратных скобках 
# несуществующее название и присваиваем какое-либо значение.

data_frame["result"] = 0 # Присваиваем колонке значение нуль.
data_frame

   price  count  result
0      8     10       0
1      9    120       0
2      1     13       0
3     78    108       0
4     81    120       0
5      8    310       0

In [155]:
data_frame[["result_1","results_2", "results_3"]] = 0 # Можно создать сразу несколько столбцов.
data_frame

   price  count  result  result_1  results_2  results_3
0      8     10       0         0          0          0
1      9    120       0         0          0          0
2      1     13       0         0          0          0
3     78    108       0         0          0          0
4     81    120       0         0          0          0
5      8    310       0         0          0          0

In [157]:
data_frame["result"] = np.NaN  # Но обычно присваивают NaN (означает пропущенное значение)
data_frame                     # Преимущество в том, что значение NaN можно потом легко исключить.

   price  count  result  result_1  results_2  results_3
0      8     10     NaN         0          0          0
1      9    120     NaN         0          0          0
2      1     13     NaN         0          0          0
3     78    108     NaN         0          0          0
4     81    120     NaN         0          0          0
5      8    310     NaN         0          0          0

**Доступ к строкам таблицы**

In [183]:
data = [{"price":8, "count":10}, {"price":9, "count":120}, {"price":1, "count":13},
        {"price":78, "count":108}, {"price":81, "count":120}, {"price":8, "count":310}]
data_frame =  pd.DataFrame(data, index = [0, 50, 100, 131, 132, 133])
data_frame

     price  count
0        8     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

In [41]:
data_frame[0] # Таким образом до нулевой строки не получится достучаться. 
              # Необходимы иные методы.

KeyError: 0

**Метод loc**  

**Метод iloc**

In [138]:
data_frame

     price  count
0        8     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

In [42]:
data_frame.loc[131] # loc позволяет достучаться к элементам строки по индексу.

price     78
count    108
Name: 131, dtype: int64

In [139]:
data_frame.iloc[1] # iloc позволяет достучаться к элементам строки по номеру строки.

price      9
count    120
Name: 50, dtype: int64

In [140]:
data_frame.iloc[-1] # Так же, как и в списках.

price      8
count    310
Name: 133, dtype: int64

In [142]:
# Однако срез будет работать без дополнительных методов.

data_frame[1:3]

     price  count
50       9    120
100      1     13

**Выбор строк по условию**

In [143]:
data_frame

     price  count
0        8     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

In [144]:
data_frame[data_frame["price"]>10] # По аналогии с объектами Series

     price  count
131     78    108
132     81    120

In [49]:
data_frame["price"]>10 # Как мы видим выше, выбрались те элементы, на местах которых стояло слово True.

0    False
1    False
2    False
3     True
4     True
5    False
Name: price, dtype: bool

In [146]:
data_frame

     price  count
0        8     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

In [149]:
data_frame[(data_frame["price"]>10) & (data_frame["count"]>110)] # Можно прописать и несколько условий

# В данном случае and и or не будут работать, необходимо ввести специальные символы вместо них.
# & --> and
# | --> or

     price  count
132     81    120

In [145]:
(data_frame["price"]>10) & (data_frame["count"]>110) 

# Как мы видим выше, выбрались те элементы, на местах которых стояло слово True.

0      False
50     False
100    False
131    False
132     True
133    False
dtype: bool

data_frame

In [148]:
data_frame[(data_frame["price"]>10) | (data_frame["count"]>110)]    # & --> and
                                                                    # | --> or

     price  count
50       9    120
131     78    108
132     81    120
133      8    310

In [147]:
(data_frame["price"]>10) | (data_frame["count"]>110)

# Как мы видим выше, выбрались те элементы, на местах которых стояло слово True.

0      False
50      True
100    False
131     True
132     True
133     True
dtype: bool

**DataFrame. Проблема списков**

In [184]:
data_frame  # У нас имеется исходный DataFrame

     price  count
0        8     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

In [185]:
data_frame_test = data_frame # Присваиваем этот DataFrame в другую переменную.
data_frame_test

     price  count
0        8     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

In [186]:
data_frame_test

     price  count
0        8     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

In [188]:
data_frame.iloc[0] # Выберем одну строку из исходного DataFrame.

price     8
count    10
Name: 0, dtype: int64

In [191]:
data_frame.iloc[0]["price"] = 0  # Присвоим price значение нуль 8-->0.
data_frame  # Как мы видим, значение изменилось.

     price  count
0        0     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

In [192]:
data_frame_test  # Однако изменился и наш тестовый DataFrame.
                 # Будьте осторожны, относитесь внимательнее к присвоению элементов.

     price  count
0        0     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

**Метод sample()**

In [193]:
data = [{"price":8, "count":10}, {"price":9, "count":120}, {"price":1, "count":13},
        {"price":78, "count":108}, {"price":81, "count":120}, {"price":8, "count":310}]
data_frame =  pd.DataFrame(data, index = [0, 50, 100, 131, 132, 133])
data_frame

     price  count
0        8     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

In [ ]:
# Данный метод возвращает случайный набор строк.
# В машинном обучении это помогает разбить выборку на тестовую и обучающую.

In [194]:
data_frame

     price  count
0        8     10
50       9    120
100      1     13
131     78    108
132     81    120
133      8    310

In [162]:
data_frame.sample() # Вернёт одну случайную строку.

    price  count
50      9    120

In [163]:
data_frame.sample() # Вернул уже другую строку.

     price  count
131     78    108

In [166]:
data_frame.sample(n = 2) # Вернёт две случайные строки.

     price  count
50       9    120
132     81    120

In [165]:
data_frame.sample(frac = 0.75) # Вернёт 75 процентов строк.

     price  count
50       9    120
100      1     13
0        8     10
133      8    310

In [168]:
data_frame.sample(n = 1, axis = 1) # Вернёт один случайный столбец

# По умолчанию axis = 0 - поэтому возвращаются строки,
# если поставить axis = 1, будут возвращаться столбцы.

     count
0       10
50     120
100     13
131    108
132    120
133    310

In [79]:
data_test = data_frame.sample(n = 1, axis = 1)
data_test

   price
0      8
1      9
2      1
3     78
4     81
5      8

In [169]:
data_frame.sample(n = 1, axis = 0)

     price  count
100      1     13

<a id="2.3"></a>
    
<font size="+2" color="indigo"><b>2.3 Загрузка данных</b></font><br>

**Данные можно скачать [здесь](https://drive.google.com/drive/folders/1gguPr9TL23vlVfvQex_-JRdhb0yKna_c?usp=sharing)**

In [171]:
# Загрузить excel-файл можно с помощью функции pd.read_excel()
data = pd.read_excel("Книга1.xlsx") 
data

,Волна,Год,Месяц,Отсечка на графике,Unnamed: 4,Сроки проведения работ,Unnamed: 6,Unnamed: 7,Ожидаемая инфляция,Unnamed: 9,Unnamed: 10,Количество населенных пунктов,Unnamed: 12,Unnamed: 13,Unnamed: 14,Количество субъектов,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19
0,12,2013.0,Март,NaT,NaN,25 марта - 1 апреля,NaN,NaN,14.5,NaN,NaN,100,NaN,NaN,NaN,44,NaN,NaN,2000,NaN
1,13,2013.0,Июнь,NaT,NaN,30 мая - 2 июня,NaN,NaN,11.0,NaN,NaN,100,NaN,NaN,NaN,43,NaN,NaN,2000,NaN
2,14,2013.0,Сентябрь,NaT,NaN,2 - 9 сентября,NaN,NaN,11.4,NaN,NaN,100,NaN,NaN,NaN,43,NaN,NaN,2000,NaN
3,15,2013.0,Декабрь,NaT,NaN,25 ноября - 2 декабря,NaN,NaN,13.0,NaN,NaN,100,NaN,NaN,NaN,43,NaN,NaN,2000,NaN
4,16,2014.0,Февраль,NaT,NaN,30 января - 3 февраля,NaN,NaN,11.8,NaN,NaN,100,NaN,NaN,NaN,43,NaN,NaN,2000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
89,92,2020.0,Октябрь,NaT,NaN,29 сентября - 9 октября,NaN,NaN,9.6,NaN,NaN,105,NaN,NaN,NaN,55,NaN,NaN,2007,NaN
90,93,2020.0,Ноябрь,NaT,NaN,2 - 12 ноября,NaN,NaN,10.1,NaN,NaN,105,NaN,NaN,NaN,55,NaN,NaN,2000,NaN
91,94,2020.0,Декабрь,NaT,NaN,30 ноября - 10 декабря,NaN,NaN,11.5,NaN,NaN,105,NaN,NaN,NaN,55,NaN,NaN,2017,NaN
92,95,2021.0,Январь,NaT,NaN,11 - 21 января,NaN,NaN,10.5,NaN,NaN,105,NaN,NaN,NaN,55,NaN,NaN,2013,NaN
93,96,2021.0,Февраль,NaT,NaN,5 - 15 февраля,NaN,NaN,9.9,NaN,NaN,105,NaN,NaN,NaN,55,NaN,NaN,2015,NaN

In [172]:
data_test = data[["Волна", "Год"]] # Выберем два столбца
data_test

    Волна     Год
0      12  2013.0
1      13  2013.0
2      14  2013.0
3      15  2013.0
4      16  2014.0
..    ...     ...
89     92  2020.0
90     93  2020.0
91     94  2020.0
92     95  2021.0
93     96  2021.0

[94 rows x 2 columns]

In [173]:
data_test.head(10) # Данный метод позволяет вывести несколько строк из начала таблицы.
                   # В данном случае метод выводит 10 строк.

   Волна     Год
0     12  2013.0
1     13  2013.0
2     14  2013.0
3     15  2013.0
4     16  2014.0
5     18  2014.0
6     19  2014.0
7     20  2014.0
8     21  2014.0
9     22  2014.0

In [174]:
data_test.tail(10) # Данный метод позволяет вывести несколько строк из конца таблицы.
                   # В данном случае метод выводит 10 строк.

    Волна     Год
84      5     NaN
85      6     NaN
86      7  2020.0
87     90  2020.0
88     91  2020.0
89     92  2020.0
90     93  2020.0
91     94  2020.0
92     95  2021.0
93     96  2021.0

In [175]:
data_nan = data_test.tail(10) # Давайте возьмём несколько строк для дальнейшей обработки.
data_nan

    Волна     Год
84      5     NaN
85      6     NaN
86      7  2020.0
87     90  2020.0
88     91  2020.0
89     92  2020.0
90     93  2020.0
91     94  2020.0
92     95  2021.0
93     96  2021.0

In [ ]:
# Данные строки интересны тем, что в некоторых из них присутствуют значения NaN.

In [88]:
data_nan.info() # Посмотрим информацию.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 82 to 93
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Волна   12 non-null     int64
 1   Год     9 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 324.0 bytes

In [ ]:
# В данном случае в столбце "год" 9 ненулевых элементов.

In [89]:
data_nan.dropna() # Данный метод позволяет исключить значения NaN.

# Значения NaN почти всегда исключаются, так как методы машинного обучения
# не могут с ними работать.

    Волна     Год
83     -1  2020.0
86      7  2020.0
87     90  2020.0
88     91  2020.0
89     92  2020.0
90     93  2020.0
91     94  2020.0
92     95  2021.0
93     96  2021.0

In [90]:
data_nan # Однако, как мы видим, dropna() не изменил исходный DataFrame.

    Волна     Год
82      4     NaN
83     -1  2020.0
84      5     NaN
85      6     NaN
86      7  2020.0
87     90  2020.0
88     91  2020.0
89     92  2020.0
90     93  2020.0
91     94  2020.0
92     95  2021.0
93     96  2021.0

In [91]:
# Чтобы изменения произошли, необходимо использовать параметр inplace.

data_nan.dropna(inplace = True)

C:\Users\ratmi\Miniconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [92]:
data_nan # Как мы видим, изменения сохранились.

    Волна     Год
83     -1  2020.0
86      7  2020.0
87     90  2020.0
88     91  2020.0
89     92  2020.0
90     93  2020.0
91     94  2020.0
92     95  2021.0
93     96  2021.0

<a id="3"></a>
    
<font size="+2" color="indigo"><b>3 Задания</b></font><br>

In [ ]:
### Команда 1

Напишите программу, которая считывает с клавиатуры числа (по одному в строке) до тех пор, 
пока сумма введённых чисел не будет равна 0 и сразу после этого возвращает сумму квадратов 
всех считанных чисел.


В примере мы считываем числа 1, -3, 5, -6, -10, 13; 
в этот момент замечаем, что сумма этих чисел равна нулю 
и возвращаем сумму их квадратов.


Ввод с клавиатуры (In):

1            
-3
5
-6
-10
13
4
-8


Выход (Out):

340

In [ ]:
### Ответ. Команда 1 

def func():
    sum_number=0
    sqr_number = 0
    while True:
        number=int(input())
        sqr_number += number**2
        sum_number+=number
        if sum_number ==0:
            return sqr_number

In [ ]:
### Команда 2

Напишите программу, которая считывает с клавиатуры числа (по одному в строке), при этом если число
нацело не делится на два, то пропускаем его. Считываем с клавиатуры до тех пор, 
пока сумма введённых чисел не будет равна 0 и сразу после этого возвращаем сумму квадратов 
всех считанных чисел.


В примере мы считываем числа 1, -3, 5, -6, -10, 13; 
в этот момент замечаем, что сумма этих чисел равна нулю 
и возвращаем сумму их квадратов.


Ввод с клавиатуры (In):

1    # Пропускаем          
-3   # Пропускаем
5    # Пропускаем
-6   # Устраивает!
-10  # Устраивает!
13   # Пропускаем
4    # Устраивает!
-8   # Устраивает!
20   # Устраивает!

Выход (Out):

In [ ]:
### Ответ. Команда 2

def func():
    sum_number = 0
    sqr_number = 0
    while True:
        number=int(input())
        if number%2!=0:
            continue
        sqr_number += number**2
        sum_number += number
        if sum_number == 0:
            return sqr_number

In [ ]:
### Команда 3

Напишите программу, которая считывает с клавиатуры числа (по одному в строке), при этом если число
нацело не делится на три, то пропускаем его. Считываем с клавиатуры до тех пор, 
пока сумма введённых чисел не будет равна 0 и сразу после этого возвращаем сумму кубов 
всех считанных чисел.


В примере мы считываем числа 1, -3, 5, -6, -10, 13; 
в этот момент замечаем, что сумма этих чисел равна нулю 
и возвращаем сумму их квадратов.


Ввод с клавиатуры (In):

1    # Пропускаем          
-3   # Устраивает!
5    # Пропускаем
-6   # Устраивает!
-10  # Пропускаем
13   # Пропускаем
4    # Пропускаем
-8   # Пропускаем
20   # Пропускаем
9    # Устраивает!

Выход (Out):

486

In [ ]:
### Ответ. Команда 3

def func():
    sum_number = 0
    sqr_number = 0
    while True:
        number=int(input())
        if number%3!=0:
            continue
        sqr_number += number**3
        sum_number += number
        if sum_number == 0:
            return sqr_number

In [ ]:
### Команда 4

Напишите программу, которая считывает с клавиатуры числа (по одному в строке), при этом если число
нацело не делится на десять, то пропускаем его. Считываем с клавиатуры до тех пор, 
пока сумма введённых чисел не будет равна 10 и сразу после этого возвращаем сумму квадратов 
всех считанных чисел.


В примере мы считываем числа 1, -3, 5, -6, -10, 13; 
в этот момент замечаем, что сумма этих чисел равна нулю 
и возвращаем сумму их квадратов.


Ввод с клавиатуры (In):

1    # Пропускаем          
-3   # Пропускаем
5    # Пропускаем
-6   # Пропускаем
-10  # Устраивает!
13   # Пропускаем
4    # Пропускаем
-8   # Пропускаем
20   # Устраивает!

Выход (Out):

500

In [ ]:
### Ответ. Команда 4

def func():
    sum_number = 0
    sqr_number = 0
    while True:
        number=int(input())
        if number%10!=0:
            continue
        sqr_number += number**2
        sum_number += number
        if sum_number == 10:
            return sqr_number